src/Documents/ПриказОДвиженииКонтингета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Document>
		<Properties>
			<Name>ПриказОДвиженииКонтингета</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.КурсыУчебныхГрупп</xr:Item>
				<xr:Item>InformationRegister.ДвижениеКонтингента</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Отделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Отделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПриказа</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыПриказов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заголовок</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗачислениеВГруппу</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УчебныеГруппы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Курс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Формулировка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>600</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отвественный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НовоеНазваниеГруппы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>24</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусСтудента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыСтудента</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СписокСтудентов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Студент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Студенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидФинансирования</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыФинансирования</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерПриказаОЗачислении</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>15</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаПриказаОЗачислении</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПодписиДокумента</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Должность</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Должности</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/Enums/СтатусыСтудента.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>СтатусыСтудента</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Абитуриент</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Студент</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отчислен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выпущен</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Documents/ПриказОДвиженииКонтингета/Forms/ФормаДокументаЗачисление/Ext/Form/Module.bsl
&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Для Каждого СтрочкаСтудента из Объект.СписокСтудентов Цикл
		ЛичныеДанные = ПолучитьДанныеСтудента(СтрочкаСтудента.Студент);
		ЗаписатьИнформациюНаСтудента(СтрочкаСтудента.Студент, ЛичныеДанные);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Функция ПолучитьДанныеСтудента(Студент)
	ДатаПоступления = Элементы.СписокСтудентов.ТекущиеДанные.ДатаПриказаОЗачислении;
	ГодПоступления = Формат(Год(ДатаПоступления),"ЧГ=100");
	
	ВидФинансирования = Элементы.СписокСтудентов.ТекущиеДанные.ВидФинансирования;
	
	ПрограммаОбучения = ПолучитьПрограммуОбучения(Объект.ЗачислениеВГруппу);
	СпециальностьИзПрограммыОбучения = ПолучитьСпециальностьИзПрограммыОбучения(ПрограммаОбучения);
	
	ЛичныеДанные = Новый Структура;
	ЛичныеДанные.Вставить("Отделение", Объект.Отделение);
	ЛичныеДанные.Вставить("ПрограммаОбучения", ПрограммаОбучения);
	ЛичныеДанные.Вставить("Специальность", СпециальностьИзПрограммыОбучения);
	ЛичныеДанные.Вставить("Курс", Объект.Курс);
	ЛичныеДанные.Вставить("ГодПоступления", ГодПоступления);
	ЛичныеДанные.Вставить("ВидФинансирования", ВидФинансирования);
	ЛичныеДанные.Вставить("ГруппаЗачисления", Объект.ЗачислениеВГруппу);
	
	Возврат ЛичныеДанные;
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьПрограммуОбучения(Группа)
	Возврат Группа.ПрограммаОбучения;
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьСпециальностьИзПрограммыОбучения(ПрограммаОбучения)
	Возврат ПрограммаОбучения.Специальность;
КонецФункции

&НаСервереБезКонтекста
Процедура ЗаписатьИнформациюНаСтудента(Студент, ЛичныеДанные)
	СтудентСсылка = Студент;
	СтудентОбъект = СтудентСсылка.ПолучитьОбъект();

	СтудентОбъект.Отделение = ЛичныеДанные.Отделение;
	СтудентОбъект.ЗачисленПрограммаОбучения = ЛичныеДанные.ПрограммаОбучения;
	СтудентОбъект.ТекущаяПрограммаОбучения = ЛичныеДанные.ПрограммаОбучения;
	СтудентОбъект.Специальность = ЛичныеДанные.Специальность;
	СтудентОбъект.Курс = ЛичныеДанные.Курс;
	СтудентОбъект.ГодПоступления = ЛичныеДанные.ГодПоступления;
	СтудентОбъект.ВидФинансирования = ЛичныеДанные.ВидФинансирования;
	СтудентОбъект.УчебнаяГруппа = ЛичныеДанные.ГруппаЗачисления;
	СтудентОбъект.СтатусСтудента = Перечисления.СтатусыСтудента.Студент;
	
	СтудентОбъект.Записать();
КонецПроцедуры

&НаКлиенте
Процедура ВидПриказаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	ОткрытьФорму(ДвижениеКонтингента.ПолучитьФормуИзВидаПриказа(ВыбранноеЗначение));
КонецПроцедуры

// проверка того, что студент уже числится в группе
&НаКлиенте
Процедура СписокСтудентовСтудентПриИзменении(Элемент)
	Студент = Элементы.СписокСтудентов.ТекущиеДанные.Студент;
	ГруппаСтудентаИзРегистра = ДвижениеКонтингента.ПолучитьГруппуСтудента(Объект.Дата, Студент);
	
	ГруппаСтудента = ПолучитьГруппу(Элементы.СписокСтудентов.ТекущиеДанные.Студент);
	Если ЗначениеЗаполнено(ГруппаСтудента) Тогда
		Сообщить("Студенты " + Элементы.СписокСтудентов.ТекущиеДанные.Студент + " уже числится в группе " + ГруппаСтудента);
	ИначеЕсли ЗначениеЗаполнено(ГруппаСтудентаИзРегистра) Тогда
		Сообщить("Студенты " + Элементы.СписокСтудентов.ТекущиеДанные.Студент + " уже числится в группе " + ГруппаСтудентаИзРегистра + ". Данные взяты из регистра сведений");
	КонецЕсли;
	
	ЗаполнитьТекущуюДатуНомер();
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьТекущуюДатуНомер()
	Элементы.СписокСтудентов.ТекущиеДанные.НомерПриказаОЗачислении = Объект.Номер;
	Элементы.СписокСтудентов.ТекущиеДанные.ДатаПриказаОЗачислении = Объект.Дата;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьГруппу(Студент)
	Возврат Студент.УчебнаяГруппа;
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьОтедениеГруппы(Группа)
	Возврат Группа.Отделение;
КонецФункции

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Объект.ВидПриказа = ДвижениеКонтингента.ПолучитьВидыПриказов().Зачисление;
	Объект.СтатусСтудента = ДвижениеКонтингента.ПолучитьСтатусыСтудента().Студент;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьКурсГруппы(Группа)
	Возврат Группа.Курс;
КонецФункции

&НаКлиенте
Процедура ЗачислениеВГруппуПриИзменении(Элемент)
	Объект.Курс = ПолучитьКурсГруппы(Объект.ЗачислениеВГруппу);
	Объект.Отделение = ПолучитьОтедениеГруппы(Объект.ЗачислениеВГруппу);
КонецПроцедуры
